MikroElektronika/core_packages/PIC/XC8/def/PIC16LF19156/mcu.h
// Register: VB2GPR
#define VB2GPR VB2GPR
extern volatile unsigned char           VB2GPR              __at(0xE8E);
#ifndef _LIB_BUILD
asm("VB2GPR equ 0E8Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned VB2GPR                 :8;
    };
    struct {
        unsigned VB2GPR0                :1;
        unsigned VB2GPR1                :1;
        unsigned VB2GPR2                :1;
        unsigned VB2GPR3                :1;
        unsigned VB2GPR4                :1;
        unsigned VB2GPR5                :1;
        unsigned VB2GPR6                :1;
        unsigned VB2GPR7                :1;
    };
} VB2GPRbits_t;
extern volatile VB2GPRbits_t VB2GPRbits __at(0xE8E);
// bitfield macros
#define _VB2GPR_VB2GPR_POSN                                 0x0
#define _VB2GPR_VB2GPR_POSITION                             0x0
#define _VB2GPR_VB2GPR_SIZE                                 0x8
#define _VB2GPR_VB2GPR_LENGTH                               0x8
#define _VB2GPR_VB2GPR_MASK                                 0xFF
#define _VB2GPR_VB2GPR0_POSN                                0x0
#define _VB2GPR_VB2GPR0_POSITION                            0x0
#define _VB2GPR_VB2GPR0_SIZE                                0x1
#define _VB2GPR_VB2GPR0_LENGTH                              0x1
#define _VB2GPR_VB2GPR0_MASK                                0x1
#define _VB2GPR_VB2GPR1_POSN                                0x1
#define _VB2GPR_VB2GPR1_POSITION                            0x1
#define _VB2GPR_VB2GPR1_SIZE                                0x1
#define _VB2GPR_VB2GPR1_LENGTH                              0x1
#define _VB2GPR_VB2GPR1_MASK                                0x2
#define _VB2GPR_VB2GPR2_POSN                                0x2
#define _VB2GPR_VB2GPR2_POSITION                            0x2
#define _VB2GPR_VB2GPR2_SIZE                                0x1
#define _VB2GPR_VB2GPR2_LENGTH                              0x1
#define _VB2GPR_VB2GPR2_MASK                                0x4
#define _VB2GPR_VB2GPR3_POSN                                0x3
#define _VB2GPR_VB2GPR3_POSITION                            0x3
#define _VB2GPR_VB2GPR3_SIZE                                0x1
#define _VB2GPR_VB2GPR3_LENGTH                              0x1
#define _VB2GPR_VB2GPR3_MASK                                0x8
#define _VB2GPR_VB2GPR4_POSN                                0x4
#define _VB2GPR_VB2GPR4_POSITION                            0x4
#define _VB2GPR_VB2GPR4_SIZE                                0x1
#define _VB2GPR_VB2GPR4_LENGTH                              0x1
#define _VB2GPR_VB2GPR4_MASK                                0x10
#define _VB2GPR_VB2GPR5_POSN                                0x5
#define _VB2GPR_VB2GPR5_POSITION                            0x5
#define _VB2GPR_VB2GPR5_SIZE                                0x1
#define _VB2GPR_VB2GPR5_LENGTH                              0x1
#define _VB2GPR_VB2GPR5_MASK                                0x20
#define _VB2GPR_VB2GPR6_POSN                                0x6
#define _VB2GPR_VB2GPR6_POSITION                            0x6
#define _VB2GPR_VB2GPR6_SIZE                                0x1
#define _VB2GPR_VB2GPR6_LENGTH                              0x1
#define _VB2GPR_VB2GPR6_MASK                                0x40
#define _VB2GPR_VB2GPR7_POSN                                0x7
#define _VB2GPR_VB2GPR7_POSITION                            0x7
#define _VB2GPR_VB2GPR7_SIZE                                0x1
#define _VB2GPR_VB2GPR7_LENGTH                              0x1
#define _VB2GPR_VB2GPR7_MASK                                0x80

// Register: VB3GPR
#define VB3GPR VB3GPR
extern volatile unsigned char           VB3GPR              __at(0xE8F);
#ifndef _LIB_BUILD
asm("VB3GPR equ 0E8Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned VB3GPR                 :8;
    };
    struct {
        unsigned VB3GPR0                :1;
        unsigned VB3GPR1                :1;
        unsigned VB3GPR2                :1;
        unsigned VB3GPR3                :1;
        unsigned VB3GPR4                :1;
        unsigned VB3GPR5                :1;
        unsigned VB3GPR6                :1;
        unsigned VB3GPR7                :1;
    };
} VB3GPRbits_t;
extern volatile VB3GPRbits_t VB3GPRbits __at(0xE8F);
// bitfield macros
#define _VB3GPR_VB3GPR_POSN                                 0x0
#define _VB3GPR_VB3GPR_POSITION                             0x0
#define _VB3GPR_VB3GPR_SIZE                                 0x8
#define _VB3GPR_VB3GPR_LENGTH                               0x8
#define _VB3GPR_VB3GPR_MASK                                 0xFF
#define _VB3GPR_VB3GPR0_POSN                                0x0
#define _VB3GPR_VB3GPR0_POSITION                            0x0
#define _VB3GPR_VB3GPR0_SIZE                                0x1
#define _VB3GPR_VB3GPR0_LENGTH                              0x1
#define _VB3GPR_VB3GPR0_MASK                                0x1
#define _VB3GPR_VB3GPR1_POSN                                0x1
#define _VB3GPR_VB3GPR1_POSITION                            0x1
#define _VB3GPR_VB3GPR1_SIZE                                0x1
#define _VB3GPR_VB3GPR1_LENGTH                              0x1
#define _VB3GPR_VB3GPR1_MASK                                0x2
#define _VB3GPR_VB3GPR2_POSN                                0x2
#define _VB3GPR_VB3GPR2_POSITION                            0x2
#define _VB3GPR_VB3GPR2_SIZE                                0x1
#define _VB3GPR_VB3GPR2_LENGTH                              0x1
#define _VB3GPR_VB3GPR2_MASK                                0x4
#define _VB3GPR_VB3GPR3_POSN                                0x3
#define _VB3GPR_VB3GPR3_POSITION                            0x3
#define _VB3GPR_VB3GPR3_SIZE                                0x1
#define _VB3GPR_VB3GPR3_LENGTH                              0x1
#define _VB3GPR_VB3GPR3_MASK                                0x8
#define _VB3GPR_VB3GPR4_POSN                                0x4
#define _VB3GPR_VB3GPR4_POSITION                            0x4
#define _VB3GPR_VB3GPR4_SIZE                                0x1
#define _VB3GPR_VB3GPR4_LENGTH                              0x1
#define _VB3GPR_VB3GPR4_MASK                                0x10
#define _VB3GPR_VB3GPR5_POSN                                0x5
#define _VB3GPR_VB3GPR5_POSITION                            0x5
#define _VB3GPR_VB3GPR5_SIZE                                0x1
#define _VB3GPR_VB3GPR5_LENGTH                              0x1
#define _VB3GPR_VB3GPR5_MASK                                0x20
#define _VB3GPR_VB3GPR6_POSN                                0x6
#define _VB3GPR_VB3GPR6_POSITION                            0x6
#define _VB3GPR_VB3GPR6_SIZE                                0x1
#define _VB3GPR_VB3GPR6_LENGTH                              0x1
#define _VB3GPR_VB3GPR6_MASK                                0x40
#define _VB3GPR_VB3GPR7_POSN                                0x7
#define _VB3GPR_VB3GPR7_POSITION                            0x7
#define _VB3GPR_VB3GPR7_SIZE                                0x1
#define _VB3GPR_VB3GPR7_LENGTH                              0x1
#define _VB3GPR_VB3GPR7_MASK                                0x80

